# encoding: utf-8

# Строка имеет метод length, который возвращает количество символов в строке
puts "Я объект типа строка!".length

# Целое число имеет метод to_f, который возвращает это же число, но
# превращенное в другой тип "вещественное число" (или число с плавающей точкой)
puts 17.to_f

# Чем целые числа отличаются от вещественных (почему это разные типы объектов):
#
# http://ru.wikipedia.org/wiki/Вещественные_числа
# http://ru.wikipedia.org/wiki/Целое_число

# Описание классов String (строка), Integer (целое число), Float (вещественное
# число или число с плавающей точкой) и доступных объектам этих классов свойств
# из документации Руби:
#
# https://ruby-doc.org/core/String.html
# https://ruby-doc.org/core/Integer.html
# https://ruby-doc.org/core/Float.html
